import matplotlib.pyplot as plt

# 決定底框-----------------------------------------------------------------
plt.axes([0.1,0.1,0.5,0.9])

# 給定刻度
plt.xticks([]),plt.yticks([]) # 不顯示x和y軸的座標

# 在框中加入文字
plt.text(0.1,0.1,'axes([0.1,0.1,0.5,0.5])',ha='left',size=16,alpha=0.5)

# 決定第二層框--------------------------------------------------------------
plt.axes([0.3,0.3,0.5,0.5])
# plt.xticks([]),plt.yticks([])
plt.text(0.1,0.1,'axes([0.3,0.3,0.5,0.5])',ha='left',size=16,alpha=0.5)

# 決定第二層框--------------------------------------------------------------
plt.axes([0.5,0.5,0.5,0.5])
plt.xticks([]),plt.yticks([])
plt.text(0.1,0.1,'axes([0.5,0.5,0.5,0.5])',ha='left',size=16,alpha=0.5)

plt.show()